In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [9]:
# how to create a df from a dictionary with list
df = DataFrame({'city': ['Madrid' , 'Barcelona','Salamanca'], 'altitude':[234,456,567]})

In [24]:
# another way to create a df
df_1 = DataFrame(np.arange(12).reshape(3,4), index = ['NY', "LA","SF"] , columns = ['A','B',"c",'d'])

In [10]:
df

        city  altitude
0     Madrid       234
1  Barcelona       456
2  Salamanca       567

In [11]:
# mapping to map the column
state_map = {'Madrid':"Comunidad_de_madrid","Barcelona": 'Cataluna','Salamanca': 'Castilla_leon'}

In [12]:
df['state'] = df['city'].map(state_map)

In [13]:
df

        city  altitude                state
0     Madrid       234  Comunidad_de_madrid
1  Barcelona       456             Cataluna
2  Salamanca       567        Castilla_leon

 - Replace method

In [15]:
ser1 = Series([1,2,34,12,3,4])
ser1

0     1
1     2
2    34
3    12
4     3
5     4
dtype: int64

In [19]:
# replace 1 value in our series to nan
ser1.replace(1,np.nan)

0     NaN
1     2.0
2    34.0
3    12.0
4     3.0
5     4.0
dtype: float64

In [20]:
# you can do multiple replace at ones
ser1.replace([1,4],[100,400])

0    100
1      2
2     34
3     12
4      3
5    400
dtype: int64

In [21]:
ser1.replace({4 :np.nan})

0     1.0
1     2.0
2    34.0
3    12.0
4     3.0
5     NaN
dtype: float64

In [25]:
# reneimin an index 
df_1

    A  B   c   d
NY  0  1   2   3
LA  4  5   6   7
SF  8  9  10  11

In [26]:
df_1.index.map(str.lower)

Index(['ny', 'la', 'sf'], dtype='object')

In [28]:
 # if you want to made the change store in a variable
df_1.index = df_1.index.map(str.lower)

In [29]:
df_1

    A  B   c   d
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [30]:
df_1.rename( index = {'ny':"NewYork"} , inplace = True)
# inplace = True (the changes are permanent!)

In [31]:
# as yoluo can see the changes are complet it
  
df_1

         A  B   c   d
NewYork  0  1   2   3
la       4  5   6   7
sf       8  9  10  11

- Binning

In [35]:
years = [ 1999, 1992, 2019, 2008, 1983]
decade_bins = [1960,1970,1980,1990,2000,2010,2020]

In [36]:
decade_cat = pd.cut(years , decade_bins)

In [37]:
decade_cat

[(1990, 2000], (1990, 2000], (2010, 2020], (2000, 2010], (1980, 1990]]
Categories (6, interval[int64]): [(1960, 1970] < (1970, 1980] < (1980, 1990] < (1990, 2000] < (2000, 2010] < (2010, 2020]]

In [38]:
  decade_cat.categories

IntervalIndex([(1960, 1970], (1970, 1980], (1980, 1990], (1990, 2000], (2000, 2010], (2010, 2020]],
              closed='right',
              dtype='interval[int64]')

In [39]:
pd.value_counts(decade_cat)

(1990, 2000]    2
(2010, 2020]    1
(2000, 2010]    1
(1980, 1990]    1
(1970, 1980]    0
(1960, 1970]    0
dtype: int64